lvx/base/DataProcessors/бит_му_ПодборВНА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_му_ПодборВНА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Comment>Построитель отчета</Comment>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Режим</Name>
					<Comment>Режим</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_РежимыПодбораВНА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>МОЛ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местонахождение</Name>
					<Comment>Местонахождение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКласса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыКлассовОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодНачисленияАмортизации</Name>
					<Comment>Метод начисления амортизации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизацииНМА</v8:Type>
						<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_МоделиУчетаВНА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Comment>Вид движения документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыДвиженияВыбытия</v8:Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыОперацийВыбытиеНМА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьОбъектов</Name>
					<Comment>Перечень объектов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнять</Name>
							<Comment>Выполнять</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВНА</Name>
							<Comment>ВНА</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
								<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКласса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_ВидыКлассовОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МодельУчета</Name>
							<Comment>Модель учета</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_МоделиУчетаВНА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Comment>Первоначальная стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПринятияКУчету</Name>
							<Comment>Дата принятия к учету</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Местонахождение</Name>
							<Comment>Местонахождение</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МОЛ</Name>
							<Comment>МОЛ</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументБУ</Name>
							<Comment>Документ БУ</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
								<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковВнеоборотныхАктивов</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПринятиеКУчетуНМА</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеНМА</v8:Type>
								<v8:Type>cfg:DocumentRef.РаспределениеНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислятьАмортизацию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодНачисленияАмортизации</Name>
							<Comment>Метод начисления амортизации</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизацииНМА</v8:Type>
								<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.бит_ДоговорыКонтрагентов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоСчету</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоГрафику</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаДолгосрочный</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаКраткосрочный</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисленнойАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаМодернизации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМодернизации</Name>
							<Comment>Сумма модернизации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоРаспределениеНДС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/DataProcessors/бит_му_ПодборВНА/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
  
// Процедура - обработчик события "ПриСозданииНаСервере" формы.
// 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	МетаданныеОбъекта = Метаданные.Обработки.бит_му_ПодборВНА;
	
	Команда = Параметры.Команда;
	
	Если Команда = "" Тогда
		бит_ОбщегоНазначения.СообщитьОбОтказеОткрытияОбработкиСамостоятельно(МетаданныеОбъекта.Синоним, Отказ);
		Возврат;
	КонецЕсли;
	
	
	Объект.Организация = Параметры.Организация;
	
	ЗакрыватьПриВыборе = Ложь;

	// Заполним значения периода
	Если Команда = "НачислениеПроцентов" Тогда
		Период.ДатаНачала    = ?(Параметры.Свойство("ДатаНачала")	, Параметры.ДатаНачала	 , НачалоДня(ТекущаяДатаСеанса()));
		Период.ДатаОкончания = ?(Параметры.Свойство("ДатаОкончания"), Параметры.ДатаОкончания, КонецДня(ТекущаяДатаСеанса()));
	Иначе
		Период.ДатаНачала    = ?(Параметры.Свойство("Дата")	, Параметры.Дата, НачалоДня(ТекущаяДатаСеанса()));	 
	КонецЕсли;
	
	ИнинциализироватьСКД(Команда);
	
	Обновить(); 
	
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтотОбъект.Заголовок = Параметры.Заголовок;
	КонецЕсли;

	УстановитьВидимость();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик события "Нажатие" кнопки "ПеренестиДобавить" 
// коммандной панели "ПереченьОбъектовКоманднаяПанель".
// 
&НаКлиенте
Процедура ПеренестиДобавить(Команда)
	
	ПеренестиДанные("Добавить");
	
КонецПроцедуры // ПеренестиДобавить()

// Процедура - обработчик события "Нажатие" кнопки "ПеренестиЗагрузить" 
// коммандной панели "ПереченьОбъектовКоманднаяПанель".
// 
&НаКлиенте
Процедура ПеренестиЗагрузить(Команда)
	
	ПеренестиДанные("Загрузить");
	
КонецПроцедуры // ПеренестиЗагрузить()

// Процедура - обработчик события "Нажатие" кнопки "ОбновитьПеречень" 
// коммандной панели "ПереченьОбъектовКоманднаяПанель".
// 
&НаКлиенте
Процедура ОбновитьПеречень(Команда)
	
	Обновить();
	
КонецПроцедуры // ОбновитьПеречень()

// Процедура - обработчик события "Нажатие" кнопки "ПереченьСнятьФлажки" 
// коммандной панели "ПереченьОбъектовКоманднаяПанель".
// 
&НаКлиенте
Процедура ПереченьСнятьФлажки(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ПереченьОбъектов, "Выполнять", 0, Элементы.ПереченьОбъектов);

КонецПроцедуры // ПереченьСнятьФлажки()

// Процедура - обработчик события "Нажатие" кнопки "ПереченьУстановитьФлажки" 
// коммандной панели "ПереченьОбъектовКоманднаяПанель".
// 
&НаКлиенте
Процедура ПереченьУстановитьФлажки(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ПереченьОбъектов, "Выполнять", 1, Элементы.ПереченьОбъектов);
	
КонецПроцедуры // ПереченьУстановитьФлажки()

// Процедура - обработчик события "Нажатие" кнопки "ПереченьИнвертироватьФлажки" 
// коммандной панели "ПереченьОбъектовКоманднаяПанель".
// 
&НаКлиенте
Процедура ПереченьИнвертироватьФлажки(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ПереченьОбъектов, "Выполнять", 2, Элементы.ПереченьОбъектов);
	
КонецПроцедуры // ПереченьИнвертироватьФлажки()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура формирует структуру подбора.
// 
// Параметры:
//  СтрокаСДанными - СтрокаТаблицыЗначений.Заявки.
// 
&НаКлиенте
Функция СформироватьСтруктуруПодбора(СтрокаСДанными)
	
	СтруктураПодбора = Новый Структура();
		
	СтруктураПодбора.Вставить("ОсновноеСредство"		 , СтрокаСДанными.ВНА);
	СтруктураПодбора.Вставить("Контрагент"				 , СтрокаСДанными.Контрагент);
	СтруктураПодбора.Вставить("ДоговорКонтрагента"		 , СтрокаСДанными.ДоговорКонтрагента);
	СтруктураПодбора.Вставить("Сумма"					 , СтрокаСДанными.Сумма);
		
	Возврат СтруктураПодбора;
	
КонецФункции // СформироватьСтруктуруПодбора()

// Процедура оповещает форму - владельца о выборе.
// 
// Параметры:
//  Параметр  - Структура или Массив.
// 
&НаКлиенте
Процедура ОповеститьВладельцаОВыборе(Команда, МассивПодбора)

	Оповестить(Команда, МассивПодбора);	

КонецПроцедуры // ОповеститьВладельцаОВыборе()

// Процедура формирует массив данных для переноса.
// 
// Параметры:
//  Команда  - Строка
// 
&НаКлиенте
Процедура ПеренестиДанные(Команда)
	
	ДанныеДляПодбора = Объект.ПереченьОбъектов.НайтиСтроки(Новый Структура("Выполнять", Истина));
	
	// Получаем количество заявок для переноса.
	Количество = ДанныеДляПодбора.Количество();	
	Если Количество <> 0 Тогда
		
		Счетчик = 0;
		
		МассивПодбора = Новый Массив;
	
		Для Каждого ТекСтрока Из ДанныеДляПодбора Цикл
			
			Счетчик = Счетчик + 1;
			
			// Сформируем структуру подбора и оповестим о выборе тек. заявки.
			СтруктураПодбора = СформироватьСтруктуруПодбора(ТекСтрока);
			МассивПодбора.Добавить(СтруктураПодбора);
			
			ТекстСообщения = НСтр("ru='Обработано ВНА: %1 из %2';en='VNA processed: %1 of %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Счетчик, Количество); 
			Состояние(ТекстСообщения);
			
		КонецЦикла;
		
		ОповеститьВладельцаОВыборе(Команда, МассивПодбора);
		
	КонецЕсли;

КонецПроцедуры // ПеренестиДанные()

// Процедура устанавливает видимость элементов формы.
// 
// Параметры:
//  Нет	
// 
&НаСервере
Процедура УстановитьВидимость()
	
	ЭтоНачПроц = (Команда = "НачислениеПроцентов");
	ЭтоРекласс = (Команда = "РеклассификацияЗадолженности");
	
	Элементы.СтраницаНачислениеПроцентов.Видимость = ЭтоНачПроц;
	Элементы.СтраницаРеклассификация.Видимость 	   = ЭтоРекласс;
	Элементы.ПериодДатаОкончания.Видимость 		   = Не ЭтоРекласс;
	
КонецПроцедуры // УстановитьВидимость()

&НаСервере
Процедура Обновить()

	Запрос    = ПолучитьЗапросСКД();
	Результат = Запрос.Выполнить();
	 
	Если Результат.Пустой() Тогда
		ТекстСообщения = НСтр("ru='Нет данных, удовлетворяющих отбору.';en='No data satisfactory selection.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 
	 
	Объект.ПереченьОбъектов.Очистить();
	 
	Выборка = Результат.Выбрать();
	 
	Пока Выборка.Следующий() Цикл
	 
	   	НоваяСтрока = Объект.ПереченьОбъектов.Добавить();
	   	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		  
  	КонецЦикла;

КонецПроцедуры // Обновить()

// Функция получает запрос схемы компановки данных для перечня документов на оплату.
// 
// Параметры:
//  АдресСКД      - Строка.
//  Компоновщик   - КомпоновщикНастроекКомпоновкиДанных.
//  ПериодРасхода - СтандартныйПериод.
// 
// Возращаемое значение:
//  Запрос.
// 
&НаСервере
Функция ПолучитьЗапросСКД()
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);

	// Выполняем компановку макета МакетСКД
	// (настройки берутся из схемы компановки данных и из пользовательских настроек).
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетСКД = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, Объект.Компоновщик.ПолучитьНастройки());
	
	// Заполняем параметры макета компановки данных.
	МакетСКД.ЗначенияПараметров.Организация.Значение   = Объект.Организация;
	Если Команда = "НачислениеПроцентов" Тогда
 		МакетСКД.ЗначенияПараметров.ДатаНачала.Значение    = Период.ДатаНачала;
		МакетСКД.ЗначенияПараметров.ДатаОкончания.Значение = Период.ДатаОкончания;
	ИначеЕсли Команда = "РеклассификацияЗадолженности" Тогда
		МакетСКД.ЗначенияПараметров.Дата.Значение    	  = Период.ДатаНачала;
		МакетСКД.ЗначенияПараметров.ДатаЧерезГод.Значение = ДобавитьМесяц(Период.ДатаНачала, 12);
	КонецЕсли;
	
	// Получаем запрос макета компановки данных
	Запрос = Новый Запрос(МакетСКД.НаборыДанных.НаборДанных.Запрос);
	
	// Устанавливаем параметры запроса
	ОписаниеПараметровЗапроса = Запрос.НайтиПараметры();
	Для каждого ОписаниеПараметраЗапроса Из ОписаниеПараметровЗапроса Цикл
		Запрос.УстановитьПараметр(ОписаниеПараметраЗапроса.Имя, МакетСКД.ЗначенияПараметров[ОписаниеПараметраЗапроса.Имя].Значение);
	КонецЦикла;
	
	Возврат Запрос;
	
КонецФункции // ПолучитьЗапросСКД()

// Процедура инициализирует схему компановки данных.
// 
// Параметры:
//  Команда  - Строка
// 
&НаСервере
Процедура ИнинциализироватьСКД(Команда)

	// Инициализация схемы компановки данных
	Если Команда = "НачислениеПроцентов" Тогда
		СхемаКомпоновкиДанных = Обработки.бит_му_ПодборВНА.ПолучитьМакет("СКДНачислениеФинансовыхПроцентов");
	ИначеЕсли Команда = "РеклассификацияЗадолженности" Тогда
	    СхемаКомпоновкиДанных = Обработки.бит_му_ПодборВНА.ПолучитьМакет("СКДРеклассификацияЗадолженности");
	КонецЕсли;
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	Объект.Компоновщик.Инициализировать(ИсточникНастроек);
	Объект.Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

КонецПроцедуры // ИнинциализироватьСКД() 

#КонецОбласти
